---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSchedule(Autodesk.Revit.DB.ElementId)
source: html/5b406f92-7dc3-7946-d2e7-f35751038945.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.SetBorderAroundSchedule Method

Adds a border around the schedule

## Syntax (C#)
```csharp
public void SetBorderAroundSchedule(
	ElementId borderId
)
```

## Parameters
- **borderId** (`Autodesk.Revit.DB.ElementId`) - The border to set around the schedule

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null